Repository: labsin/TilEm
Catalog: po/*.po
Languages: fr

source: Failed to open '%s' for writing: %s
fr: Impossible d'ouvrir '%s' en ecriture: %s

source: Error while closing '%s': %s
fr: Erreur lors de la fermeture '%s': %s

source: Playback stopped unexpectedly
fr: Lecture arrêtée inopinément

source: WARNING: Audio buffer underrun by %d bytes
fr: ATTENTION : Débordement de buffer audio de %d bytes

source: Initialized "%s" driver
fr: Driver "%s" initialisé

source: Unknown sample format
fr: Format de l'échantillon inconnu

source: Cannot create semaphore: %s
fr: Impossible de créer le sémaphore: %s

source: buffer size = %d, latency = %.3g
fr: Taille buffer = %d, latence = %.3g

source: TilEm has not been compiled with sound support.
fr: TilEm n'a pas été compilé avec le support du son.

source: Audio Properties
fr: Propriétés audios

source: C_hannels:
fr: _Canal:

source: _Driver:
fr: _Pilote:

source: Automatic
fr: Automatique

source: Sampling _rate (kHz):
fr: Fréquence d'échantillonnage (kHz):

source: _Latency (ms):
fr: _Latence (ms):

source: Memory address (logical)
fr: Adresse memoire (logique)

source: Address
fr: Adresse

source: Memory address (absolute)
fr: Adresse memoire (absolue)

source: I/O port
fr: Port d'entree/sortie

source: Port Number
fr: Port numero

source: Z80 instruction
fr: Instruction Z80

source: _Start:
fr: _Debut:

source: _Value:
fr: _Valeur:

source: Breakpoint _type:
fr: _Type du Breakpoint:

source: Break when:
fr: S'arreter quand:

source: _Reading
fr: _Lecture

source: _Writing
fr: _Ecriture

source: E_xecuting
fr: E_xecution

source: Breakpoint Condition
fr: Condition du Breakpoint

source: R_ange
fr: Ech_antillon de valeurs

source: S_tart:
fr: Debu_t:

source: _End:
fr: _Fin:

source: Add Breakpoint
fr: Ajouter un Breakpoint

source: Edit Breakpoint
fr: Editer un Breakpoint

source: Clear all breakpoints?
fr: Effacer tous les breakpoints?

source: All existing breakpoints will be deleted and cannot be restored.
fr: Tous les breakpoints existants vont etre effaces sans possibilite de restauration ulterieure

source: Start
fr: Debut

source: End
fr: Fin

source: Break on _invalid instructions
fr: S'arreter sur les instructions _invalides

source: Break on _undocumented instructions
fr: S'arreter sur les instcurtions non doc_umentees

source: Unable to read settings
fr: Impossible de lire les preferences

source: An error occurred while reading %s: %s
fr: Une erreur est survenue lors de la lecture de %s: %s

source: Unable to save settings
fr: Impossible de sauvegarder les preferences

source: An error occurred while writing %s: %s
fr: Une erreur est survenue lors de l'ecriture de %s: %s

source: invalid argument
fr: Argument invalide

source: Unable to read symbols
fr: Impossible de lire les symboles

source: Go to Address
fr: Aller a l'Adresse

source: Address:
fr: Adresse:

source: Pause emulation
fr: Emulation en pause

source: Resume emulation
fr: Relancer l'emulation

source: Execute one instruction
fr: Executer une instruction

source: Run to the next line (skipping over subroutines)
fr: Aller a la prochaine ligne (sans entrer dans les sous-routines

source: _Finish Subroutine
fr: _Finir la sous-routine

source: Run to end of the current subroutine
fr: Executer jusqu'a la fin de la sous routine actuelle

source: Toggle Breakpoint
fr: Activer/Desactiver Breakpoint

source: Enable or disable breakpoint at the selected address
fr: Activer ou desactiver le breakpoint a l'adresse selectionnee

source: Add, remove, or modify breakpoints
fr: Ajouter, supprimer ou modifier les breakpoints

source: _Address...
fr: _Adresse...

source: Jump to an address
fr: Sauter a l'Adresse

source: Current P_C
fr: P_C actuel

source: Jump to the current program counter
fr: Sauter a la valeur de PC

source: _Previous Stack Entry
fr: _Precedente valeur de la pile

source: Jump to the previous address in the stack
fr: Sauter a la precedente adresse de le pile

source: _Next Stack Entry
fr: Valeur _suivante de la pile

source: Jump to the next address in the stack
fr: Sauter a la prochaine adresse de la pile

source: One Byte _Backward
fr: Un octet _Avant

source: Scroll backward by one byte
fr: Aller un octet en arriere

source: One Byte _Forward
fr: Un octet plus _loin

source: Scroll forward by one byte
fr: Aller un octet plus loin

source: _Logical Addresses
fr: Adre_sse logique

source: Show contents of the current Z80 address space
fr: Montrer le contenu de l'adresse courante

source: _Absolute Addresses
fr: Adresse _Absolue

source: Show all memory contents
fr: Afficher tout le contenu de la memoire

source: Close the debugger
fr: Fermer le debugger

source: _Keypad
fr: Clavier _virtuel

source: Show the calculator keypad state
fr: Afficher l'etat du clavier

source: _Breakpoint Here
fr: _Breakpoint Ici

source: _Go to Address...
fr: Aller a l'a_dresse...

source: Go to P_C
fr: Aller au P_C

source: Addr
fr: Adr

source: Disassembly
fr: Desassembleur

source: Unknown error (%d)
fr: Erreur inconnue (%d)

source: Link cable I/O error
fr: Erreur d'entree/sortie

source: Unable to open link cable
fr: Impossible d'envoyer le fichier

source: Unable to open sound device
fr: Impossible d'envoyer le fichier

source: Unable to play sound
fr: Impossible de charger la skin

source: No ROM file specified
fr: Aucun fichier ROM specifie

source: Unable to open %s for reading: %s
fr: Impossible d'ouvrir %s en lecture: %s

source: The file %s is not a recognized calculator ROM file.
fr: Le fichier %s n'est pas reconnu en tant que fichier ROM.

source: The specified ROM or state file is invalid.
fr: Le fichier ROM ou le fichier de sauvegarde est invalide.

source: Unable to open %s for writing: %s
fr: Impossible d'ourvrir %s en ecriture: %s

source: Error writing %s: %s
fr: Erreur lors de l'ecriture %s: %s

source: Open Calculator
fr: Ouvrir une Calculatrice (ROM)

source: ROM files
fr: Fichiers ROM

source: All files
fr: Tous les fichiers

source: Unable to load calculator state
fr: Impossible de charger le fichier de sauvegarde de la calculatrice

source: Unable to load skin
fr: Impossible de charger la skin

source: TilEm is a TI Linux Emulator. It emulates all current z80 models. TI73, TI76, TI81, TI82, TI83(+)(SE), TI84+(SE), TI85 and TI86 ;D
fr: TilEm est emulateur de calculatrices TI pour Linux. Il emule tous les modeles actuels de calculatrices TI a base de processeur z80. TI73, TI76, TI81, TI82, TI83(+)(SE), TI84+(SE), TI85 et TI86 ;D

source: Select a folder to save received files.
fr: Choisir un repertoire pour sauver les fichiers recus.

source: A file named "%s" already exists. Do you want to replace it?
fr: Un fichier nomme "%s" existe deja. Voulew-vous le remplacer?

source: The file already exists in "%s". Replacing it will overwrite its contents.
fr: Le fichier existe deja dans "%s". Le remplacer va effacer son contenu.

source: _Replace
fr: _Remplacer

source: Browse...
fr: Parcourir...

source: missing sentinel
fr: sentinelle manquante

source: no bindings for %s
fr: pas de raccourci pour %s

source: syntax error in key bindings: '%s=%s'
fr: erreur de syntaxe dans le fichier des raccourcis clavier: '%s=%s'

source: Unable to load key bindings
fr: Impossible de charger les raccourcis clavier

source: The file keybindings.ini could not be found. TilEm may not have been installed correctly.
fr: Le fichier keybindings.ini est introuvable. TilEm n'a pas ete installe correctement.

source: Keypad
fr: Clavier virtuel

source: Group %d
fr: Groupe %d

source: <b>Scan Groups</b>
fr: <b>Groupe de touches</b>

source: <b>Keys</b>
fr: <b>Clavier virtuel</b>

source: Input Value:
fr: Valeur d'entree:

source: INTERNAL ERROR: cable already opened
fr: ERREUR INTERNE: cable deja ouvert

source: INTERNAL ERROR: cable already closed
fr: ERREUR INTERNE: cable deja ferme

source: unsupported calc
fr: calc non supportee

source: File I/O error
fr: Erreur d'entree/sortie

source: Not a valid PRG file
fr: Ce n'est pas un fichier PRG valide

source: The calculator does not have enough free memory to load the program.
fr: La calculatrice ne possede pas assez de memoire libre pour charger le programme

source: All calculator program slots are in use. You must delete an existing program before loading a new program.
fr: Tous les emplacements pour les programmes sont utilises. Vous devez d'abord supprimer un programme existant avant de charger un nouveau programme

source: The calculator is currently busy. Please exit to the home screen before loading programs.
fr: La calculatrice est actuellement occupee. Veuillez quitter l'ecran home avant de charger un programme.

source: Unknown error code (%d)
fr: Code d'erreur inconnu (%d)

source: Failed to open %s for reading: %s
fr: Impossible d'ouvrir %s en lecture: %s

source: The file %s is not a valid TI-81 program file.
fr: Le fichier %s n'est pas un programme TI-81 valide.

source: Sending %s
fr: Envoi de %s

source: The file %s is not a valid program or variable file.
fr: Le fichier %s n'est pas un programme valide ou un fichier variable valide.

source: Unable to send file
fr: Impossible d'envoyer le fichier

source: %s %s files
fr: %s %s fichier group

source: Reading variable list
fr: Lecture de la liste de variables

source: Receiving variables
fr: Reception des variables

source: TI-81 programs
fr: Programmes TI-81

source: Unable to receive variable list
fr: Impossible de recevoir la liste de variables

source: Applications cannot be saved in an XXg group file. Try using TIG format or saving apps individually.
fr: Impossible de sauver en tant aue XXg group file. Essayez d'utiliser le format TIG ousauvez les applications individuellement.

source: TI-81 programs cannot be saved in a group file. Try saving programs individually.
fr: Les programmes de TI-81 ne peuvent etre sauves en tant aue fichier groupes. Essayez de les sauver individuellement.

source: Failed to open %s for writing: %s
fr: Impossible d'ouvrir %s en ecriture: %s

source: Unable to save file
fr: Impossible de sauvegarder le fichier

source: Variable %s not found
fr: Variable %s non trouvee

source: Gray TI Graph Link
fr: TI Graph link (gris)

source: Black TI Graph Link
fr: TI Graph link (noir)

source: Silver TI Graph Link (USB)
fr: TI Graph link silver (USB)

source: Parallel Link
fr: Cable parallele

source: Link Port
fr: Cable port

source: _Disconnected
fr: _Deconnecte

source: Connected to _speakers
fr: Connecter a un cable _externe

source: Ad_vanced...
fr: A_vancé...

source: Connected to another _emulator (virtual cable)
fr: Connecter a un autre _emulateur (cable virtuel)

source: Connected to an e_xternal link cable
fr: Connecter a un cable externe

source: Cable _type:
fr: _Type de cable:

source: USB drivers not found. You must install TiLP (%s) in order to use an external link cable.
fr: Pilotes USB introuvables. Vous devez installer TiLP (%s) pour pouvoir être en mesure d'utiliser le cable externe.

source: Save macro
fr: Sauver macro

source: Macro files
fr: Fichier macro

source: Nothing to play
fr: Rien a executer

source: Open macro
fr: Ouvrir une macro

source: x%c: WARNING:
fr: x%c: ATTENTION:

source: x%c: INTERNAL ERROR:
fr: x%c: ERREUR INTERNE:

source: Send _File...
fr: Envoyer un _Fichier

source: Send a program or variable file to the calculator
fr: Envoyer un programme ou une variable vers la calculatrice

source: Re_ceive File...
fr: Re_cevoir un fichier

source: Receive a program or variable from the calculator
fr: Recevoir un programme ou une variable depuis la calulatrice

source: _Link Cable...
fr: Cable _Link...

source: Connect to an external link cable
fr: Connecter a un cable externe

source: _Open Calculator...
fr: _Ouvrir une Calculatrice (ROM)

source: Open a calculator ROM file
fr: Ouvrir une Calculatrice (ROM)

source: _Save Calculator
fr: _Sauver la calculatrice

source: Save current calculator state
fr: Sauver l'etat courant

source: Re_vert Calculator State
fr: Annuler la sau_vegarde

source: Revert to saved calculator state
fr: Revenir a la sauvegarde

source: _Reset Calculator
fr: _Reset calc

source: Reset the calculator
fr: Reset calc

source: Pause emulation and start the debugger
fr: Mettre en pause et demarrer le debugger

source: _Record
fr: En_registrer

source: Begin recording a macro
fr: Commencer a enregistrer une macro

source: Play back the current macro
fr: Jouer encore la macro

source: _Open Macro File...
fr: _Ouvrir une macro

source: Load a macro from a file
fr: Charger une macro depuis un fichier

source: _Save Macro File...
fr: _Sauver le fichier Macro

source: Save current macro to a file
fr: Sauver la macro courante dans un fichier

source: Save a screenshot
fr: Prendre un screenshot

source: _Quick Screenshot
fr: Screenshot _rapide

source: Save a screenshot using default settings
fr: Sauver un screenshot en utilisant les preferences par defaut

source: Edit emulator settings
fr: Editer les preferences de l'emulateur

source: _About
fr: _A propos

source: Print some informations about TilEm 2 and its authors
fr: Affiche des informations a propos de TilEm 2 et de ses auteurs

source: _Quit
fr: _Quitter

source: Quit the application
fr: Quitter l'application

source: (paused)
fr: (en pause)

source: _Limit to actual calculator speed
fr: _Limiter la vitesse a la vitesse de la calculatrice

source: As _fast as possible
fr: Aussi _vite que possible

source: Emulation Speed
fr: Vitesse d'emulation

source: Emulate _grayscale
fr: Emuler les niveaux de _gris

source: Use _smooth scaling
fr: Utili_ser calibrage doux

source: Use s_kin:
fr: Utiliser la s_kin:

source: Select Skin
fr: Choisir une Skin

source: Skin files
fr: Fichier skin

source: Display
fr: Affichage

source: Replace existing file?
fr: Remplacer un fichier existant

source: The file "%2$s" already exists in "%1$s". Replacing it will overwrite its contents.
fr: Le fichier "%2$s" existe deja dans "%1$s". Le remplacer va effacer son contenu.

source: Save File
fr: Sauver le fichier

source: untitled.%s
fr: sanstitre.%s

source: %s group files
fr: %s fichier group

source: TIGroup files
fr: Fichiers TIGroup

source: Save Files to Directory
fr: Sauver les fichier dans le repertoire

source: Slot
fr: Emplacement

source: Name
fr: Nom

source: Size
fr: Taille

source: Receive File
fr: Recevoir un fichier

source: Save as:
fr: Sauvegarder en tant que:

source: S_eparate files
fr: Fichier s_epares

source: _Group file
fr: Fichiers _Groupes

source: screenshot saved : %s
fr: screenshot sauve : %s

source: Unable to save screenshot
fr: Impossible de sauvegarder le screenshot

source: Custom
fr: Personnalise

source: _Grab
fr: _Shot

source: Image si_ze:
fr: Taille de l'_image:

source: _Width:
fr: Lar_geur:

source: _Height:
fr: _Hauteur:

source: Animation s_peed:
fr: Vite_sse d'animation:

source: _Foreground:
fr: _Premier plan:

source: _Background:
fr: _Arriere plan:

source: Save Screenshot
fr: Prendre un screenshot

source: File name does not have a recognized suffix
fr: Le nom du fichier doit contenir une extension valide

source: %s (in use: %s)
fr: %s (utilise: %s)

source: %s (in use)
fr: %s (utilise)

source: File
fr: Fichier

source: Select Program Slots
fr: Selectionner un emplacement pour le programme

source: Select a slot where each program should be loaded. If a program slot is already in use, its contents will be overwritten.
fr: Choisir un emplacement ou les programmes doivent etre charges. Si un emplacement est deja utilise, son contenu sera ecrase.

source: TI-73 files
fr: Fichiers TI-73

source: TI-82 files
fr: Fichiers TI-82

source: TI-83 files
fr: Fichiers TI-83

source: TI-83 Plus files
fr: Fichiers TI-83 Plus

source: TI-85 files
fr: Fichiers TI-85

source: TI-86 files
fr: Fichiers TI-86

source: All compatible files
fr: Tous les fichiers compatibles

source: Send File
fr: Envoyer un Fichier

source: Unable to open this file: <%s>
fr: Impossible d'ourvir cd fichier: <%s>

source: Bad skin format
fr: Format de skin invalide

source: Unable to load background image
fr: Impossible de charger l'image de fond

source: The file %s is not a valid skin.
fr: Le fichier %s n'est pas une skin.

source: warning: checksum incorrect
fr: attention: checksum incorrect

source: The rom file to run
fr: Le fichier rom a executer

source: FILE
fr: FICHIER

source: The skin file to use
fr: Fichier skin

source: The model to use
fr: Le modele a utiliser

source: NAME
fr: NOM

source: The state-file to use
fr: Le fichier de sauvegarde a utiliser

source: Start in skinless mode
fr: Debuter sans skin

source: Reset the calc at startup
fr: Reset la calculatrice au demarrage

source: Get a var at startup
fr: Recuperer une variable au demarrage

source: Run this macro at startup
fr: Executer cette macro au demarrage

source: Launch debugger
fr: Denarrer le debugger

source: Run at normal speed
fr: Executer a la vitesse normale

source: Run at maximum speed
fr: Executer a la vitesse maximum

source: %s: unknown model %s
fr: %s: modele inconnu %s

source: %s: invalid link cable %s
fr: %s: cable ivalide %s

source: Select Calculator Type
fr: Selectonnez le modele de calculatrice

source: Calculator type for %s:
fr: Type de calculatrice pour %s:

source: utf8_to_filename: unsupported charset %s
fr: utf8_to_filename: charset non supporte %s

source: utf8_to_filename: error in conversion
fr: utf8_to_filename: erreur de conversion

source: untitled
fr: sanstitre

source: 8-bit, unsigned
fr: 8-bits, non signé

source: 8-bit, signed
fr: 8-bits, signé

source: 16-bit, unsigned, little-endian
fr: 16-bit, non signé, little-endian

source: 16-bit, signed, little-endian
fr: 16-bit, signé, little-endian

source: 16-bit, unsigned, big-endian
fr: 16-bit, non signé, big-endian

source: 16-bit, signed, big-endian
fr: 16-bit, signé, big-endian

source: buffer overrun
fr: debordement de buffer

source: output sampling rate undefined
fr: fréquence d'echantillonnage de sortie non défini

source: number of output channels undefined
fr: nombre de canaux de sortie indéfini

source: output sample format undefined
fr: format d'échantillon de sortie indéfini

source: Starting playback:
fr: Démarrer la lecture:

source: rate = %d
fr: fréquence = %d

source: channels = %d
fr: canaux = %d

source: buffer size = %d
fr: taille du buffer = %d

source: invalid sampling rate (%d)
fr: frequence d'échantillonnage invalide (%d)

source: invalid number of channels (%d)
fr: nombre de canaux invalide (%d)

source: invalid sample format (%d)
fr: format d'échantillon invalide (%d)

source: invalid buffer size (%d)
fr: taille du buffer invalide (%d)

source: Repairing certificate area...
fr: Réparation de la zone du certificat...

source: Found application at page %02x (index %d)
fr: Application trouvée à la page %02x (index %d)

source: Flash error (%s)
fr: Erreur de flash (%s)

source: bad program %02x over %02x
fr: mauvais programme %02x sur %02x

source: reading from Flash while programming
fr: lecture de la Flash pendant la programmation

source: reading from Flash while erasing
fr: lecture de la Flash pendant l'écrasement

source: reading during program/erase sequence
fr: lecture pendant une sequence d'écrasement ou un programme

source: erasing protected sector
fr: ecrasement du secteur protégé

source: undefined command %02x->%06x after AA
fr: commande indéfinie %02x->%06x après AA

source: attempt to erase without pre-erase
fr: tentative d'écrasement sans pré-écrasement

source: autoselect is not implemented
fr: auto select non implémenté

source: undefined command %02x->%06x after AA,55
fr: commande indéfinie %02x->%06x après AA,55

source: programming protected sector
fr: programmation du secteur protégé

source: mixing fast programming with regular programming: %02x->%06x
fr: mélange programmation rapide avec programmation lente: %02x->%06x

source: undefined command %02x->%06x after fast mode pre-exit 90
fr: commande non définie %02x->%06x après mode pré-exit rapide 90

source: undefined command %02x->%06x after pre-erase
fr: commande indéfinie %02x->%06x après pré-écrasement

source: undefined command %02x->%06x after pre-erase AA
fr: commande indéfinie %02x->%06x après pré-écrasement AA

source: Erasing entire Flash chip
fr: Ecrasement entier de la puce Flash

source: undefined command %02x->%06x after pre-erase AA,55
fr: commande indéfinie %02x->%06x après pré-écrasement AA,55

source: Invalid MD5 mode %d
fr: Mode MD5 invalide %d

source: Unknown hwreg %s
fr: Hwreg inconnue %s

source: Unknown timer %s
fr: Timer inconnu %s

source: invalid bp type
fr: invalide bp type

source: setting invalid timer %d
fr: Mise en place d'un timer invalide %d

source: removing invalid timer %d
fr: suppression du timer invalide %d

source: querying invalid timer %d
fr: demande de timer invalide %d

source: attempt to remove invalid breakpoint %d
fr: Tentative de supprimer le breakpoint invalide %d

source: attempt to access invalid breakpoint %d
fr: Tentative d'accès au breakpoint invalide %d

source: attempt to modify invalid breakpoint %d
fr: tentative de modifier un breakpoint invalide %d

source: No timers set
fr: Pas de timer mis en place

source: Invalid opcode %x
fr: Code opérande invalide %x

source: Input from port %x
fr: Entrée dans le port %x

source: Flash unlocked
fr: Flash déverrouillée

source: Flash locked
fr: Flash vérouillée

source: Writing to protected port %02x
fr: Ecriture sur le port protégé %02x

source: Reading from read-protected sector
fr: Lecture d'un secteur protégé

source: Executing in restricted Flash area
fr: Execution dans la zone Flash restreinte

source: Executing in restricted RAM area
fr: Execution dans la RAM restreinte

source: No OS installed
fr: Pas d'OS installé

source: No-exec mask set to %x
fr: Masque de non execution affecté à %x

source: Keypad locked
fr: Clavier virtuel

source: Keypad unlocked
fr: Clavier déverrouillé

source: Unknown control instruction %x
fr: Instruction invalides %x

source: No-exec mask for 08-0F set to %x
fr: Masque de non execution pour 08-0F affecté à %x

source: No-exec mask for 10-17 set to %x
fr: Masque de non executionpour 10-17 affecté à %x

source: No-exec mask for 18-1B set to %x
fr: Masque de non execution pour 18-1B affecté à %x

source: No-exec mask for RAM set to %x
fr: Masque de non execution affecté pour RAM à %x
